Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: Attaching files to content
ca_es: Adjunció de fitxers al contingut

source: The File module allows users to attach files to content (e.g., PDF files, spreadsheets, etc.), when a <em>File</em> field is added to a given content type using the <a href="@fieldui-help">Field UI module</a>. You can add validation options to your File field, such as specifying a maximum file size and allowed file extensions.
ca_es: El mòdul File permet als usuaris adjuntar fitxers al contingut (p.e., fitxers PDF, fulls de càlcul, etc.), quan s'afegeix un camp <em>File</em> a un tipus de contingut donat utilitzant el <a href="@fieldui-help">mòdul File UI</a>. Podeu afegir opcions de validació al vostre camp File, com especificar la mida màxima del fitxer i les extensions permeses.

source: Managing attachment display
ca_es: Gestió de la visualització dels adjunts

source: When you attach a file to content, you can specify whether it is <em>listed</em> or not. Listed files are displayed automatically in a section at the bottom of your content; non-listed files are available for embedding in your content, but are not included in the list at the bottom.
ca_es: Al adjuntar un fitxer al contingut, podeu especificar si es <em>llisten</em> o no. Els fitxers llistats es mostren automàticament en una secció a la part inferior del vostre contingut; els fitxers no llistats estan disponibles per a inserir-los al vostre contingut, però no s'inclouen a la llista de la part inferior.

source: Managing file locations
ca_es: Gestió de la ubicació dels fitxers

source: When you create a File field, you can specify a directory where the files will be stored, which can be within either the <em>public</em> or <em>private</em> files directory. Files in the public directory can be accessed directly through the web server; when public files are listed, direct links to the files are used, and anyone who knows a file's URL can download the file. Files in the private directory are not accessible directly through the web server; when private files are listed, the links are Drupal path requests. This adds to server load and download time, since Drupal must start up and resolve the path for each file download request, but allows for access restrictions.
ca_es: Al crear un camp Fitxer, podeu especificar un directori on s'emmagatzemaran els fitxers, que pot estar dins del directori de fitxers <em>public</em> o <em>privat</em>. Als fitxers del directori públic s'hi pot accedir directament des del servidor web, quan els fitxers es llisten, s'utilitzen enllaços directes al fitxer i qualsevol que conegui la URL del fitxer pot descarregar-lo. Els fitxers del directori privat no són accessibles directament a través del servidor web, quan els fitxers es llisten, els enllaços són peticions de Drupal. Això se suma a la càrrega del servidor i al temps de descàrrega, ja que el Drupal ha d'iniciar i resoldre el camí per cada petició de descàrrega de fitxer, però permet restriccions d'accés.

source: An unrecoverable error occurred. Use of this form has expired. Try reloading the page and submitting again.
ca_es: Hi ha hagut un error irrecuperable. L'ús d'aquest formulari ha expirat. Proveu de recarregar la pàgina i tornar a enviar.

source: Referencing to the file used in the !name field is not allowed.
ca_es: No està permès referenciar al fitxer utilitzat en el camp !name.

source: The file referenced by the !name field does not exist.
ca_es: No existeix el fitxer referenciat pel camp !name.

source: The file in the !name field was unable to be uploaded.
ca_es: No s'ha pogut carregat el fitxer al camp !name.

source: The upload directory %directory for the file field !name could not be created or is not accessible. A newly uploaded file could not be saved in this directory as a consequence, and the upload was canceled.
ca_es: El directori de pujades %directory per al camp de fitxer !name no s'ha pogut crear o bé no és accessible. Com a conseqüència, un fitxer recentment carregat no s'ha pogut desar en aquest directori i s'ha cancel·lat la càrrega.

source: Your server is not capable of displaying file upload progress. File upload progress requires an Apache server running PHP with mod_php.
ca_es: El vostre servidor no és capaç de mostrar el progrés de càrrega de fitxers. Això requereix d'un servidor Apache executant PHP amb el mod_php.

source: All roles may use this format
ca_es: Tots els rols poden utilitzar aquest format

source: The text format ordering has been saved.
ca_es: S'ha desat l'ordre dels formats de text.

source: Add text format
ca_es: Afegeix un format de text

source: All roles for this text format must be enabled and cannot be changed.
ca_es: Tots els rols per aquest format de text han d'estat habilitats i no es poden canviar.

source: Filter processing order
ca_es: Ordre de processament dels filtres

source: Text format names must be unique. A format named %name already exists.
ca_es: Els noms dels formats de text han de ser únics. Ja existeix un format anomenat %name.

source: Added text format %format.
ca_es: S'ha afegit el format de text %format.

source: The text format %format has been updated.
ca_es: S'ha actualitzat el format de text %format.

source: Are you sure you want to delete the text format %format?
ca_es: Esteu segur de voler eliminar el format de text %format?

source: If you have any content left in this text format, it will be switched to the %fallback text format. This action cannot be undone.
ca_es: Si teniu cap contingut en aquest format de text, serà canviat al format de text %fallback. Aquesta acció no es pot desfer.

source: Deleted text format %format.
ca_es: S'ha suprimit el format de text %format.

source: Text formats
ca_es: Formats de text

source: The Filter module allows administrators to configure text formats. A text format defines the HTML tags, codes, and other input allowed in content and comments, and is a key feature in guarding against potentially damaging input from malicious users. For more information, see the online handbook entry for <a href="@filter">Filter module</a>.
ca_es: El mòdul Filter permet als administradors configurar els formats de text. Un format de text defineix les etiquetes HTML, els codis i d'altres entrades que es permeten al contingut i als comentaris, i és clau en la protecció contra la introducció de continguts potencialment nocius dels usuaris malintencionats. Per a més informació, aneu a la secció del <a href="@filter">mòdul Filter</a> del manual en línia.

source: Applying filters to text
ca_es: Aplicació de filtres al text

source: Each text format uses filters to manipulate text, and most formats apply several different filters to text in a specific order. Each filter is designed for a specific purpose, and generally either adds, removes, or transforms elements within user-entered text before it is displayed. A filter does not change the actual content, but instead, modifies it temporarily before it is displayed. One filter may remove unapproved HTML tags, while another automatically adds HTML to make URLs display as clickable links.
ca_es: Cada format de text utilitza filtres per a manipular el text, i la majoria d'ells apliquen diversos filtres al text en un ordre concret. Cada filtre està dissenyat per a un propòsit específic i, generalment, afegeix, elimina o transforma elements del text introduït per l'usuari abans de mostrar-lo. Un filtre no canvia el contingut actual, però en canvi, el modifica temporalment abans de mostrar-lo. Un filtre pot eliminar etiquetes HTML no aprovades, mentre un altre afegeix automàticament HTML perquè els enllaços referenciats al text siguin clicables.

source: Defining text formats
ca_es: Definició de formats de text

source: One format is included by default: <em>Plain text</em> (which removes all HTML tags). Additional formats may be created by your installation profile when you install Drupal, and more can be created by an administrator on the <a href="@text-formats">Text formats page</a>.
ca_es: S'inclou un format de forma predeterminada: <em>Text pla</em> (el qual elimina totes les etiquetes HTML). Altres formats poden ser creats pel vostre perfil d'instal·lació al moment d'instal·lar el Drupal, i un administrador en pot crear més a la <a href="@text-formats">pàgina de formats de text</a>.

source: Choosing a text format
ca_es: Elecció d'un format de text

source: Users with access to more than one text format can use the <em>Text format</em> fieldset to choose between available text formats when creating or editing multi-line content. Administrators can determine the text formats available to each user role, and control the order of formats listed in the <em>Text format</em> fieldset on the <a href="@text-formats">Text formats page</a>.
ca_es: Els usuaris amb accés a més d'un format de text poden utilitzar el conjunt de camps <em>Format del text</em> per a escollir entre els formats de text disponibles al crear o editar contingut de múltiples línies. Els administradors poden determinar els formats de text disponibles per a cadascun dels rols, i controlar l'ordre dels formats llistats al conjunt de camps <em>Format del text</em> a la <a href="@text-formats">pàgina de formats de text</a>.

source: Control which HTML tags and other formatting can be used for text input. Don't allow too much formatting for untrusted users. This can be a serious security risk.
ca_es: Controleu quines etiquetes HTML i d'altres formats es poden utilitzar per a la introducció de text. No permeteu gaires formats als usuaris que no són de confiança. Això pot ser un risc de seguretat seriós.

source: Text formats are presented in the order you arrange them below. Configure a text format to change its behavior.
ca_es: Els formats de text es presentaran en l'ordre que organitzeu a continuació. Configureu un format de text per a canviar-ne el seu comportament.

source: A text format contains filters that change the user input, for example stripping out malicious HTML or making URLs clickable. Filters are executed from top to bottom and the order is important, since one filter may prevent another filter from doing its job. For example, when URLs are converted into links before disallowed HTML tags are removed, all links may be removed. When this happens, the order of filters may need to be re-arranged.
ca_es: Un format de text conté filtres que canvien el text entrat pels usuaris, per exemple, tallant HTML maliciós o fent clicables les URLs. Els filtres s'executen de dalt a baix i l'ordre és important, ja que un filtre pot evitar que un altre faci la seva feina. Per exemple, quan les URLs es converteixen en enllaços abans d'eliminar les etiquetes HTML no permeses, pot ser que s'eliminin tots els enllaços. Quan això passa, pot ser necessari la reorganització de l'ordre dels filtres.

source: Administer and use any text formats and filters
ca_es: Administra i utilitza qualsevol format de text i filtre

source: Warning: This permission may have security implications depending on how the text format is configured.
ca_es: Avís: Aquest permís pot tenir implicacions de seguretat en funció de com estigui configurat el format de text.

source: Use the !text_format text format
ca_es: Utilitza el format de text !text_format

source: More information about text formats
ca_es: Més informació sobre els formats de text

source: Limit allowed HTML tags
ca_es: Limita les etiquetes HTML permeses

source: Convert line breaks into HTML (i.e. <code>&lt;br&gt;</code> and <code>&lt;p&gt;</code>)
ca_es: Transforma els salts de línia en HTML (ex. <code>&lt;br&gt;</code> i <code>&lt;p&gt;</code>)

source: Convert URLs into links
ca_es: Transforma les URL en enllaços

source: Correct faulty and chopped off HTML
ca_es: Corregeix HTML defectuós i tallat

source: Display any HTML as plain text
ca_es: Mostra qualsevol HTML com a text pla

source: A list of HTML tags that can be used. JavaScript event attributes, JavaScript URLs, and CSS are always stripped.
ca_es: Una llista d'etiquetes HTML que poden ser utilitzades. Els atributs d'events JavaScript, les URLs JavaScript i el CSS sempre s'eliminen.

source: Display basic HTML help in long filter tips
ca_es: Mostra ajuda bàsica d'HTML en suggeriments llargs de filtrat.

source: Add rel="nofollow" to all links
ca_es: Afegeix rel="nofollow" a tots els enllaços

source: This site allows HTML content. While learning all of HTML may feel intimidating, learning how to use a very small number of the most basic HTML "tags" is very easy. This table provides examples for each tag that is enabled on this site.
ca_es: Aquest lloc permet contingut HTML. Mentre aprendre tot l'HTML pot semblar intimidatori, aprendre com s'han d'utilitzar un petit nombre de les "etiquetes" més bàsiques de l'HTML és ben senzill. Aquesta taula proporciona exemples de cadascuna de les etiquetes habilitades en aquest lloc.

source: For more information see W3C's <a href="@html-specifications">HTML Specifications</a> or use your favorite search engine to find other sites that explain HTML.
ca_es: Per a més informació, consulteu l'<a href="@html-specifications">Especificació HTML</a> del W3C o utilitzeu el vostre cercador preferit per a buscar altres llocs que expliquin HTML.

source: Most unusual characters can be directly entered without any problems.
ca_es: Molts caràcters poc usuals es poden introduir sense cap problema.

source: If you do encounter problems, try using HTML character entities. A common example looks like &amp;amp; for an ampersand &amp; character. For a full list of entities see HTML's <a href="@html-entities">entities</a> page. Some of the available characters include:
ca_es: Si teniu problemes, intenteu utilitzar entitats de caràcter HTML. Un exemple d'això és &amp;amp; per un caràcter àmpersand &amp;. Per obtenir una llista completa de les entitats, consulteu la pàgina d'<a href="@html-entities">entitats</a> HTML. Alguns dels caràcters disponibles inclouen:

source: No HTML tags allowed.
ca_es: No es permet l'ús d'etiquetes HTML.

source: Delete text format
ca_es: Suprimeix el format de text

source: Filters content in preparation for display.
ca_es: Filtra el contingut per preparar-lo per a la presentació.

source: By !author @time ago
ca_es: Per !author fa @time

source: The forum %term and all sub-forums have been deleted.
ca_es: S'ha suprimit el fòrum %term i tots els seus subfòrums.

source: The number of replies a topic must have to be considered "hot".
ca_es: El nombre de respostes que ha de tenir un tema per a considerar-lo "calent".

source: No containers or forums available. <a href="@container">Add container</a> or <a href="@forum">Add forum</a>.
ca_es: No hi ha contenidors ni fòrums disponibles. <a href="@container">Afegiu un contenidor</a> o <a href="@forum">Afegiu un fòrum</a>.

source: forum: deleted %term and all its sub-forums.
ca_es: fòrum: s'ha suprimit %term i tots els seus sub-fòrums.

source: The Forum module lets you create threaded discussion forums with functionality similar to other message board systems. Forums are useful because they allow community members to discuss topics with one another while ensuring those conversations are archived for later reference. In a forum, users post topics and threads in nested hierarchies, allowing discussions to be categorized and grouped. The forum hierarchy consists of:
ca_es: El mòdul Forum us permet crear fòrums de discussió amb fils amb funcionalitats similars a d'altres sistemes de tauler de missatges. Els fòrums són útils perquè permeten als membres d'una comunitat discutir temes entre ells assegurant que les converses queden arxivades per a futures referències. En un fòrum, els usuaris introdueixen debats i fils en jerarquies niuades, permetent així que les discussions siguin categoritzades i agrupades. La jerarquia d'un fòrum consisteix en:

source: Optional containers (for example, <em>Support</em>), which can hold:
ca_es: Un contenidor opcional (per exemple, <em>Suport</em>), que pot contenir:

source: Forums (for example, <em>Installing Drupal</em>), which can hold:
ca_es: Fòrums (per exemple, <em>Instal·lació del Drupal</em>), que pot contenir:

source: Forum topics submitted by users (for example, <em>How to start a Drupal 6 Multisite</em>), which start discussions and are starting points for:
ca_es: Temes de debat enviats pels usuaris (per exemple, <em>Com començar un Drupal 6 multilloc</em>), que comencen les discussions i és un punt de partida per:

source: Threaded comments submitted by users (for example, <em>You have these options...</em>).
ca_es: Comentaris ens fils enviats pels usuaris (per exemple, <em>Tens aquestes opcions...</em>).

source: Setting up forum structure
ca_es: Creació de l'estructura de fòrum

source: Visit the <a href="@forums">Forums page</a> to set up containers and forums to hold your discussion topics.
ca_es: Aneu a la <a href="@forums">pàgina de fòrums</a> per a crear els contenidors i els fòrums que contenen els vostres temes de discussió.

source: Starting a discussion
ca_es: Iniciar una discussió

source: The <a href="@create-topic">Forum topic</a> link on the <a href="@content-add">Add new content</a> page creates the first post of a new threaded discussion, or thread.
ca_es: L'enllaç <a href="@create-topic">Tema de debat</a> a la pàgina d'<a href="@content-add">afegir nou contingut</a> crea la primera entrada d'una nova discussió o fil.

source: Enabling the Forum module provides a default <em>Forums</em> menu item in the navigation menu that links to the <a href="@forums">Forums page</a>.
ca_es: Al habilitar el mòdul Forum, aquest proporciona un element de menú anomenat <em>Fòrums</em> dins del menú de navegació que enllaça a la <a href="@forums">pàgina de Fòrums</a>.

source: Moving forum topics
ca_es: Moure temes de debat

source: A forum topic (and all of its comments) may be moved between forums by selecting a different forum while editing a forum topic. When moving a forum topic between forums, the <em>Leave shadow copy</em> option creates a link in the original forum pointing to the new location.
ca_es: Un tema de debat (i tots els seus comentaris) pot ser mogut entre els fòrums seleccionant-ne un de diferent mentre s'edita el tema de debat. Al moure'l entre fòrums, l'opció <em>Deixa una còpia d'ombra</em> crea un enllaç al fòrum original apuntant a la nova localització.

source: Locking and disabling comments
ca_es: Bloqueig i inhabilitació de comentaris

source: Selecting <em>Closed</em> under <em>Comment settings</em> while editing a forum topic will lock (prevent new comments on) the thread. Selecting <em>Hidden</em> under <em>Comment settings</em> while editing a forum topic will hide all existing comments on the thread, and prevent new ones.
ca_es: Al seleccionar <em>Tancat</em> als <em>Paràmetres dels comentaris</em> mentre s'edita un tema de debat, bloquejarà (hi evitarà nous comentaris) el fil. Al seleccionar <em>Ocult</em> als <em>Paràmetres dels comentaris</em> mentre s'edita un tema de debat, amagarà els comentaris existents al fil, i n'evitarà de nous.

source: Forums contain forum topics. Use containers to group related forums.
ca_es: Els fòrums contenen temes de debat. Utilitzeu contenidors per agrupar fòrums relacionats.

source: Use containers to group related forums.
ca_es: Utilitzeu contenidors per agrupar fòrums relacionats.

source: A forum holds related forum topics.
ca_es: Un fòrum conté temes de debat relacionats.

source: Adjust the display of your forum topics. Organize the forums on the <a href="@forum-structure">forum structure page</a>.
ca_es: Ajusteu la visualització dels vostres temes de debat. Organitzeu els fòrums a la <a href="@forum-structure">pàgina d'estructura dels fòrums</a>.

source: Add new @node_type
ca_es: Afegeix un nou @node_type

source: <a href="@login">Log in</a> to post new content in the forum.
ca_es: <a href="@login">Inicieu sessió</a> per afegir nou contingut al fòrum.

source: The item %forum is a forum container, not a forum. Select one of the forums below instead.
ca_es: L'element %forum és un contenidor de fòrums, no pas un fòrum. Seleccioneu un dels següents fòrums en lloc.

source: A <em>forum topic</em> starts a new discussion thread within a forum.
ca_es: Un <em>tema de debat</em> comença un nou fil de discussió en un fòrum.

source: Control forum hierarchy settings.
ca_es: Controleu els paràmetres de jerarquia dels fòrums.

source: Forum navigation vocabulary
ca_es: Vocabulari de navegació de fòrum

source: Provides discussion forums.
ca_es: Proporciona fòrums de discussió.

source: Follow these steps to set up and start using your website:
ca_es: Seguiu aquests passos per a configurar i començar a utilitzar el vostre lloc web:

source: <strong>Start posting content</strong> Finally, you can <a href="@content">add new content</a> for your website.
ca_es: <strong>Comenceu publicant contingut</strong> Finalment, podeu <a href="@content">afegir nou contingut</a> per al vostre lloc web.

source: For more information, refer to the specific topics listed in the next section or to the <a href="@handbook">online Drupal handbooks</a>. You may also post at the <a href="@forum">Drupal forum</a> or view the wide range of <a href="@support">other support options</a> available.
ca_es: Per a més informació, vegeu els temes específics enumerats a la següent secció o als <a href="@handbook">manuals en línia del Drupal</a>. També podeu escriure al <a href="@forum">fòrum del Drupal</a> o consultar l'àmplia gamma <a href="@support">d'opcions de suport</a> disponibles.

source: The Help module provides <a href="@help-page">Help reference pages</a> and context-sensitive advice to guide you through the use and configuration of modules. It is a starting point for the online <a href="@handbook">Drupal handbooks</a>. The handbooks contain more extensive and up-to-date information, are annotated with user-contributed comments, and serve as the definitive reference point for all Drupal documentation. For more information, see the online handbook entry for the <a href="@help">Help module</a>.
ca_es: El mòdul Help proporciona <a href="@help-page">Pàgines d'ajuda de referència</a> i ajuda sensible al context per a guiar-vos a través de l'ús i configuració dels mòduls. És un punt de partida per als <a href="@handbook">manuals en línia del Drupal</a>. Els manuals contenen informació més àmplia i actualitzada, estan anotats amb comentaris dels usuaris i serveixen com a punt de referència definitiu per a tota la documentació del Drupal. Per a més informació, aneu a la secció del <a href="@help">mòdul Help</a> del manual en línia.

source: Providing a help reference
ca_es: Proporciona una ajuda de referència

source: The Help module displays explanations for using each module listed on the main <a href="@help">Help reference page</a>.
ca_es: El mòdul Help mostra explicacions per a l'ús de cada mòdul a la <a href="@help">pàgina principal d'ajuda de referència</a>.

source: Providing context-sensitive help
ca_es: Proporciona ajuda sensible al context

source: The Help module displays context-sensitive advice and explanations on various pages.
ca_es: El mòdul Help mostra ajuda sensible al context i explicacions a vàries pàgines.

source: Reference for usage, configuration, and modules
ca_es: Referència per a l'ús, la configuració i els mòduls

source: Edit %name style
ca_es: Edita l'estil %name

source: This image style is currently being provided by a module. Click the "Override defaults" button to change its settings.
ca_es: Aquest estil d'imatge el proporciona un mòdul. Feu clic al botó "Sobreescriu els valors per defecte" per a canviar els seus paràmetres.

source: Image style name
ca_es: Nom de l'estil d'imatge
